const TITLE: string = "💣 What is Fork Bomb ?";

const ForkBomb = () => {
  return (
    <div className="h-full flex flex-col w-9/12 mx-auto overflow-scroll">
      <h1 className="text-5xl font-bold mb-12">{TITLE}</h1>

      <div className="flex flex-col gap-10">
        <p>
          ปกติแล้วชีวิตของการทำงานเป็นโปรแกรมเมอร์ หลาย ๆ
          คนคงมีโอกาสได้ใช้คำสั่ง Bash command หรือ Shell script
          มาแล้วบ้างไม่มากก็น้อย โดยทั่วไปแล้ว
          เจ้าสิ่งนี้ก็มักจะมีติดมากับคอมพิวเตอร์ของทุกคน (terminal on Mac,
          powershell on Windows)
          <br />
          <br />
          และเหล่าโปรแกรมเมอร์ มักจะใช้คำสั่งเหล่านี้
          เพื่อช่วยอำนวยความสะดวกให้การทำงานมีความง่ายขึ้น
          ไม่ต้องเลื่อนเมาส์ไปมาระหว่างจอ
          แต่สามารถควบคุมทุกอย่างได้ผ่านทางคีย์บอร์ด และคำสั่งได้เลย
          <br />
          <br />
          ยกตัวอย่างเช่น
          <ul className="list-disc list-inside indent-4">
            <li>การดูไฟล์ทั้งหมดใน directory นั้น ด้วยคำสั่ง ls</li>
            <li>การดูชื่อเครื่องคอมพิวเตอร์ ด้วยคำสั่ง whoami</li>
            <li>การดูชื่อของ directory ปัจจุบันที่กำลังอยู่ ด้วยคำสั่ง pwd</li>
            <li>การลบไฟล์ ด้วยคำสั่ง rm</li>
            <li>การเรียกแมวออกมา ด้วยคำสั่ง cat</li>
            <li>หรือแม้กระทั่ง การย้าย directory ไปมาด้วยคำสั่ง cd เป็นต้น</li>
          </ul>
          <br />
          <br />
          แต่รู้หรือไม่ว่า มีอยู่คำสั่งนึงที่เป็นอันตรายต่อคอมพิวเตอร์มาก
          ถึงขั้นที่ว่าจะทำให้คอมพิวเตอร์ทำอะไรไม่ได้
          นอกเสียจากต้องรีสตาร์ทเครื่องใหม่สถานเดียว
          <br />
          <br />
          ขอเชิญพบกับพระเอกของเราในวันนี้
        </p>
        <div className="text-4xl text-center">{":(){:|:&};:"}</div>
        ใช่ครับ นี่คือคำสั่งเพียงแค่ 11 ตัวอักษร ที่จะทำให้คอมพิวเตอร์ของคุณค้าง
        จนต้องรีสตาร์ทเครื่องอย่างเดียว
        <h2>ทำไมถึงเป็นเช่นนั้น ? 🧐</h2>
      </div>
    </div>
  );
};

export default ForkBomb;
